// Напишите программу, которая по
// заданному номеру четверти, показывает диапазон
// возможных координат точек в этой четверти (x и y).

double number  = 3.09232321;
double numberRound = Math.Round(number,2);
Console.WriteLine(numberRound);

double sqrt = Math.Sqrt(5);